In [61]:
import pandas as pd
import numpy as np

In [89]:
# Save DataFrame to CSV without indexes
df2.to_csv('HR_cleaned_data.csv', index=False)

## dump the data in mysql

In [1]:
!pip install pandas mysql-connector-python

Requirement already satisfied: pandas in c:\users\admin\appdata\local\packages\pythonsoftwarefoundation.python.3.11_qbz5n2kfra8p0\localcache\local-packages\python311\site-packages (2.2.0)
Requirement already satisfied: mysql-connector-python in c:\users\admin\appdata\local\packages\pythonsoftwarefoundation.python.3.11_qbz5n2kfra8p0\localcache\local-packages\python311\site-packages (8.3.0)
Requirement already satisfied: numpy<2,>=1.23.2 in c:\users\admin\appdata\local\packages\pythonsoftwarefoundation.python.3.11_qbz5n2kfra8p0\localcache\local-packages\python311\site-packages (from pandas) (1.24.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\admin\appdata\local\packages\pythonsoftwarefoundation.python.3.11_qbz5n2kfra8p0\localcache\local-packages\python311\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\admin\appdata\local\packages\pythonsoftwarefoundation.python.3.11_qbz5n2kfra8p0\localcache\local-packages\python311\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\admin\appdata\local\packages\pythonsoftwarefoundation.python.3.11_qbz5n2kfra8p0\localcache\local-packages\python311\site-packages (from pandas) (2024.1)
Requirement already satisfied: six>=1.5 in c:\users\admin\appdata\local\packages\pythonsoftwarefoundation.python.3.11_qbz5n2kfra8p0\localcache\local-packages\python311\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [2]:
import pandas as pd
import mysql.connector
from mysql.connector import Error

In [9]:
df = pd.read_csv('data.csv')

C:\Users\admin\AppData\Local\Temp\ipykernel_11224\2264381611.py:1: DtypeWarning: Columns (1) have mixed types. Specify dtype option on import or set low_memory=False.
  df = pd.read_csv('data.csv')

In [10]:
df

        eid       Job   Salary  Unnamed: 3  Unnamed: 4
0       1.0   Mangaer  20000.0         NaN         NaN
1       2.0     Clerk  42000.0         NaN         NaN
2       3.0  Salesman  13000.0         NaN         NaN
3       4.0     Clerk   7000.0         NaN         NaN
4       5.0  Salesman  13000.0         NaN         NaN
...     ...       ...      ...         ...         ...
541668  NaN       NaN      NaN         NaN         NaN
541669  NaN       NaN      NaN         NaN         NaN
541670  NaN       NaN      NaN         NaN         NaN
541671  NaN       NaN      NaN         NaN         NaN
541672  NaN       NaN      NaN         NaN         NaN

[541673 rows x 5 columns]

In [11]:
df.drop(columns= ['Unnamed: 3',"Unnamed: 4"],inplace=True)
df

        eid       Job   Salary
0       1.0   Mangaer  20000.0
1       2.0     Clerk  42000.0
2       3.0  Salesman  13000.0
3       4.0     Clerk   7000.0
4       5.0  Salesman  13000.0
...     ...       ...      ...
541668  NaN       NaN      NaN
541669  NaN       NaN      NaN
541670  NaN       NaN      NaN
541671  NaN       NaN      NaN
541672  NaN       NaN      NaN

[541673 rows x 3 columns]

In [12]:
df.dropna(how='all',inplace=True)
df

   eid       Job   Salary
0  1.0   Mangaer  20000.0
1  2.0     Clerk  42000.0
2  3.0  Salesman  13000.0
3  4.0     Clerk   7000.0
4  5.0  Salesman  13000.0
5  6.0     Clerk  22000.0

In [13]:
# Save DataFrame to CSV without indexes
df.to_csv('cleaned_data.csv', index=False)

In [14]:
try:
    connection = mysql.connector.connect(host='localhost',
                                         database='testdb',
                                         user='root',
                                         password='Root@#123$')
    if connection.is_connected():
        db_Info = connection.get_server_info()
        print("Connected to MySQL Server version ", db_Info)
except Error as e:
    print("Error while connecting to MySQL", e)

Connected to MySQL Server version  8.0.28

In [15]:
# Define a mapping between pandas data types and MySQL data types
data_types_mapping = {
    'int64': 'INT',
    'float64': 'FLOAT',
    'object': 'TEXT',  # For simplicity, assuming all non-numeric types are stored as text
    'datetime64': 'DATETIME'
}

In [17]:
# Create Table
cursor = connection.cursor()

# Get column names and their data types from DataFrame
columns = ",".join([f"{col} {data_types_mapping[str(df[col].dtype)]}" for col in df.columns])

# Create table with columns
cursor.execute(f"CREATE TABLE IF NOT EXISTS employee ({columns})")

# Insert Data
data = [tuple(row) for row in df.values]
cursor.executemany(f"INSERT INTO employee VALUES ({','.join(['%s'] * len(df.columns))})", data)

# Commit Changes and Close Connection
connection.commit()
cursor.close()
connection.close()